nxp-mcuxpresso/mcux-soc-svd/MCXC161/MCXC161.xml
      </registers>
    </peripheral>
    <peripheral derivedFrom="LPUART0">
      <name>LPUART1</name>
      <description>LPUART</description>
      <groupName>LPUART</groupName>
      <baseAddress>0x400A0000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x34</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>LPUART1</name>
        <value>32</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="LPUART0">
      <name>LPUART2</name>
      <description>LPUART</description>
      <groupName>LPUART</groupName>
      <baseAddress>0x400A1000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x34</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>LPUART2</name>
        <value>33</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="LPUART0">
      <name>LPUART3</name>
      <description>LPUART</description>
      <groupName>LPUART</groupName>
      <baseAddress>0x400A2000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x34</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>LPUART3</name>
        <value>34</value>
      </interrupt>
    </peripheral>
    <peripheral>
      <name>FLEXPWM0</name>
      <description>Enhanced Flex Pulse Width Modulator (eFlexPWM)</description>
      <groupName>FLEXPWM</groupName>
      <baseAddress>0x400A9000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x196</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>FLEXPWM0_RELOAD_ERROR</name>
        <value>44</value>
      </interrupt>
      <interrupt>
        <name>FLEXPWM0_FAULT</name>
        <value>45</value>
      </interrupt>
      <interrupt>
        <name>FLEXPWM0_SUBMODULE0</name>
        <value>46</value>
      </interrupt>
      <interrupt>
        <name>FLEXPWM0_SUBMODULE1</name>
        <value>47</value>
      </interrupt>
      <interrupt>
        <name>FLEXPWM0_SUBMODULE2</name>
        <value>48</value>
      </interrupt>
      <registers>
        <register>
          <name>SM0CNT</name>
          <description>Counter Register</description>
          <addressOffset>0</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>CNT</name>
              <description>Counter Register Bits</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SM0INIT</name>
          <description>Initial Count Register</description>
          <addressOffset>0x2</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>INIT</name>
              <description>Initial Count Register Bits</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SM0CTRL2</name>
          <description>Control 2 Register</description>
          <addressOffset>0x4</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>CLK_SEL</name>
              <description>Clock Source Select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>IPBUS</name>
                  <description>The IPBus clock is used as the clock for the local prescaler and counter.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXT_CLK</name>
                  <description>EXT_CLK is used as the clock for the local prescaler and counter.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUX_CLK</name>
                  <description>Submodule 0's clock (AUX_CLK) is used as the source clock for the local prescaler and counter. This setting should not be used in submodule 0 as it forces the clock to logic 0.</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RELOAD_SEL</name>
              <description>Reload Source Select</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOCAL</name>
                  <description>The local RELOAD signal is used to reload registers.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MASTER</name>
                  <description>The master RELOAD signal (from submodule 0) is used to reload registers. This setting should not be used in submodule 0 as it forces the RELOAD signal to logic 0.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FORCE_SEL</name>
              <description>Force Select</description>
              <bitOffset>3</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOCAL</name>
                  <description>The local force signal, CTRL2[FORCE], from this submodule is used to force updates.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MASTER</name>
                  <description>The master force signal from submodule 0 is used to force updates. This setting should not be used in submodule 0 as it holds the FORCE OUTPUT signal to logic 0.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOCAL_RELOAD</name>
                  <description>The local reload signal from this submodule is used to force updates without regard to the state of LDOK.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MASTER_RELOAD</name>
                  <description>The master reload signal from submodule0 is used to force updates if LDOK is set. This setting should not be used in submodule0 as it holds the FORCE OUTPUT signal to logic 0.</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOCAL_SYNC</name>
                  <description>The local sync signal from this submodule is used to force updates.</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MASTER_SYNC</name>
                  <description>The master sync signal from submodule0 is used to force updates. This setting should not be used in submodule0 as it holds the FORCE OUTPUT signal to logic 0.</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXT_FORCE</name>
                  <description>The external force signal, EXT_FORCE, from outside the eFlexPWM module causes updates.</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXT_SYNC</name>
                  <description>The external sync signal, EXT_SYNC, from outside the eFlexPWM module causes updates.</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FORCE</name>
              <description>Force Initialization</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FRCEN</name>
              <description>Force Enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Initialization from a FORCE_OUT is disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Initialization from a FORCE_OUT is enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INIT_SEL</name>
              <description>Initialization Control Select</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PWM_X</name>
                  <description>Local sync (PWM_X) causes initialization.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MASTER_RELOAD</name>
                  <description>Master reload from submodule 0 causes initialization. This setting should not be used in submodule 0 as it forces the INIT signal to logic 0. The submodule counter will only re-initialize when a master reload occurs.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MASTER_SYNC</name>
                  <description>Master sync from submodule 0 causes initialization. This setting should not be used in submodule 0 as it forces the INIT signal to logic 0.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXT_SYNC</name>
                  <description>EXT_SYNC causes initialization.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWMX_INIT</name>
              <description>PWM_X Initial Value</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PWM45_INIT</name>
              <description>PWM45 Initial Value</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PWM23_INIT</name>
              <description>PWM23 Initial Value</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INDEP</name>
              <description>Independent or Complementary Pair Operation</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>COMPLEMENTARY</name>
                  <description>PWM_A and PWM_B form a complementary PWM pair.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INDEPENDENT</name>
                  <description>PWM_A and PWM_B outputs are independent PWMs.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DBGEN</name>
              <description>Debug Enable</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
