nxp-mcuxpresso/mcux-soc-svd/MCXC161/MCXC161.xml
      </registers>
    </peripheral>
    <peripheral>
      <name>OPAMP0</name>
      <description>Operational Amplifier</description>
      <groupName>OPAMP</groupName>
      <baseAddress>0x400B7000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0xC</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>VERID</name>
          <description>Version ID</description>
          <addressOffset>0</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FEATURE</name>
              <description>Feature Specification Number</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MINOR</name>
              <description>Minor Version Number</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MAJOR</name>
              <description>Major Version Number</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PARAM</name>
          <description>Parameter</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x1</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PGA_FUNCTION</name>
              <description>PGA Function Option</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CORE_AMP</name>
                  <description>Core amplifier enabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PGA</name>
                  <description>PGA function enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>OPAMP_CTR</name>
          <description>OPAMP Control</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x1000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>EN</name>
              <description>OPAMP Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MODE</name>
              <description>Mode Selection</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOW</name>
                  <description>High performance mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HIGH</name>
                  <description>Low power mode</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BIASC</name>
              <description>Bias Current Trim Selection</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DEF</name>
                  <description>Default</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INC</name>
                  <description>Increase current</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DEC</name>
                  <description>Decrease current</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FUR_DEC</name>
                  <description>Further decrease current</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INTREF</name>
              <description>Provide OPAMP rail to rail voltage selection</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>VDDA2</name>
                  <description>Select OPAMP input rail to rail voltage from 0 to VDD_ANA</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VDDA3V</name>
                  <description>Select OPAMP input rail to rail voltage from 0 to VDD_ANA-0.8V</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VSSA3V</name>
                  <description>Select OPAMP input rail to rail voltage from 0.8V to VDD_ANA</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOT</name>
                  <description>Not allowed</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TRIGMD</name>
              <description>Trigger Mode</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INPSEL</name>
              <description>Positive Input Channel Selection</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INP0</name>
                  <description>When OPAMP is not in trigger mode, select positive input 0 (INP0)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INP1</name>
                  <description>When OPAMP is not in trigger mode, select positive input 1 (INP1)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INPF</name>
              <description>Positive Input Connection Status</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INP0</name>
                  <description>Positive input 0 (INP0)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INP1</name>
                  <description>Positive input 1 (INP1)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BUFEN</name>
              <description>Reference Buffer</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Disables</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Enables</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PREF</name>
              <description>Positive Reference Voltage Selection</description>
              <bitOffset>17</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>VAL0</name>
                  <description>Input 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VAL1</name>
                  <description>Input 1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VAL2</name>
                  <description>Input 2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VAL3</name>
                  <description>Input 3</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADCSW1</name>
              <description>Measure Switch 1</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Measure negative gain resistor ladder voltage switch off</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ON</name>
                  <description>Measure negative gain resistor ladder voltage switch on</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADCSW2</name>
              <description>Measure Switch 2</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Measure positive gain resistor ladder reference voltage switch off</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Measure positive gain resistor ladder reference voltage switch on</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OUTSW</name>
              <description>Output Switch</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>OPAMP out to negative gain resistor ladder switch off</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ON</name>
                  <description>OPAMP out to negative gain resistor ladder switch on</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PGAIN</name>
              <description>Positive PGA Selection</description>
              <bitOffset>24</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INP1</name>
                  <description>Positive input 1 (INP1)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>G2</name>
                  <description>Pgain=1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>G3</name>
                  <description>Pgain=2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>G5</name>
                  <description>Pgain=4</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>G9</name>
                  <description>Pgain=8</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>G17</name>
                  <description>Pgain=16</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>G34</name>
                  <description>Pgain=33</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>G65</name>
                  <description>Pgain=64</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NGAIN</name>
              <description>Negative PGA Selection</description>
              <bitOffset>28</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BUFFER</name>
                  <description>Buffer</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>G1</name>
                  <description>Ngain=1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>G2</name>
                  <description>Ngain=2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>G4</name>
                  <description>Ngain=4</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>G8</name>
                  <description>Ngain=8</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>G16</name>
                  <description>Ngain=16</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>G33</name>
                  <description>Ngain=33</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>G64</name>
                  <description>Ngain=64</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
